{
  "amphibious": {
    "description": "This unit does not suffer terrain penalties for fighting in water or on land.",
    "cost": 50
  },
  "bred for war": {
    "description": "This unit cannot be diminished, and cannot have disadvantage on morale checks.",
    "cost": 100
  },
  "brutal": {
    "description": "This unit inflicts 2 casualties on a successful power check.",
    "cost": 200
  },
  "courageous": {
    "description": "Once per battle, this unit can choose to succeed on a morale check it just failed.",
    "cost": 50
  },
  "eternal": {
    "description": "This unit cannot be horrified, and it always succeeds on morale checks to attack undead and fiends.",
    "cost": 50
  },
  "frenzy": {
    "description": "If this unit diminishes an enemy unit, it immediately makes a free attack against that unit.",
    "cost": 50
  },
  "horrify": {
    "description": "If this unit inflicts a casualty on an enemy unit, that unit must make a DC 15 morale check. Failure exhausts the unit.",
    "cost": 200
  },
  "martial": {
    "description": "If this unit succeeds on a power check and its size is greater than the defending unit, it inflicts 2 casualties.",
    "cost": 100
  },
  "mindless": {
    "description": "This unit cannot fail morale checks.",
    "cost": 100
  },
  "regenerate": {
    "description": "When this unit refreshes, increment its casualty die. This trait ceases to function if the unit suffers a casualty from battle magic.",
    "cost": 200
  },
  "ravenous": {
    "description": "While any enemy unit is diminished, this unit can spend a round feeding on the corpses to increment their casualty die.",
    "cost": 50
  },
  "hurl rocks": {
    "description": "If this unit succeeds on an attack check, it inflicts 2 casualties. Against fortifications it inflicts 1d6 casualties.",
    "cost": 250
  },
  "savage": {
    "description": "This unit has advantage on the first power check it makes each battle.",
    "cost": 50
  },
  "stalwart": {
    "description": "Enemy battle magic has disadvantage on power checks against this unit.",
    "cost": 50
  },
  "twisting roots": {
    "description": "As an action, this unit can sap the walls of a fortification. Siege units have advantage on power checks against sapped fortifications.",
    "cost": 200
  },
  "undead": {
    "description": "Green and regular troops must pass a morale check to attack this unit. Each enemy unit need only do this once.",
    "cost": 50
  }
}
